#pragma once

#include "GameObject.h"

namespace tge {

	const unsigned MAX_OBJECTS = 100000; //! Максимальное количество объектов на одном игровом поле
	const unsigned LAYERS_COUNT = 2; //! Количество слоёв объектов на одном игровом поле

	//! Названия всех слоёв (для удобства)
	enum LayerNames {
		BASE, TEST_LAYER
	};

	//! Структура, хранящая все удалённые в данный кадр объекты (их ID)
	struct KilledArray
	{
		int obj_id[MAX_OBJECTS]; //! Массив ID удалённых объектов. -1 означает отсутствия объекта
		unsigned top; //! Кол-во удалённых объектов
	};

	//! Хранит все объекты на данном слое
	struct Layer {
		int obj_id[MAX_OBJECTS]; //! Массив ID объектов на данном слое. -1 означает отсутствие объекта
		unsigned top; //! Кол-во объектов на слое
	};

	//! Данные об одном конкретном объекте
	struct ObjectData
	{
		GameObject* obj; //! Указатель на объект
		/*!
		* Указывает индекс объекта в соотвествуеющем слое.
		* -1, если объект отсутствует в соответствующем слое
		*/
		int layer_pos[LAYERS_COUNT];
	};

	//! Данные обо всех объектах на игровом поле, о всех слоях и об объектах, подлежащих удалению
	struct ObjectsArray
	{
		ObjectData obj[MAX_OBJECTS]; //! массив данных ВСЕХ объектов. Динамический ID объекта - позиция его данных в этом массиве
		Layer layers[LAYERS_COUNT]; //! массив данных обо всех слоях
		KilledArray to_kill; //! объекты, подлежащие удалению по окончанию кадра
		unsigned top; //! кол-во всех объектов на игровом поле
	};
}

//! Данные, которые необходимо предоставить игровому полю, чтобы добавить в него объект
struct GameobjectSpawnData
{
	GameObject* obj; //! Указатель на уже созданный объект, которому выделена память и который инициализирован
	bool is_on_layer[tge::LAYERS_COUNT]; //! Информация о том, на каких слоях он присутствует
};
